# Welcome to Pandas Exercise

In [1]:
import numpy as np
import pandas as pd

**EXERCISE 1 - List-to-Series Conversion
Given a list, output the corresponding pandas series**

In [2]:
list=[2,3,4,5]

In [3]:
a=pd.Series(list)

In [4]:
a

0    2
1    3
2    4
3    5
dtype: int64

**EXERCISE 2 - List-to-Series Conversion with Custom Indexing
Given a series, output the corresponding pandas series with odd indexes only**

In [5]:
list

[2, 3, 4, 5]

In [6]:
b=pd.Series(list,index=[1,3,5,7])

In [7]:
b

1    2
3    3
5    4
7    5
dtype: int64

**EXERCISE 3 - Date Series Generation
Generate the series of dates from 1st May, 2021 to 12th May, 2021 (both inclusive)**

In [8]:
c=pd.date_range(start='05-01-2021',end='05-12-2021')

In [9]:
c

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

**EXERCISE 4 - Implementing a function on each and every element of a series
Apply the function, f(x) = x/2 on each and every element of a given pandas series**

In [10]:
series=pd.Series([2,3,4,5,6,7])

In [11]:
series

0    2
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [12]:
new_list=series.apply(lambda x:x/2)

In [13]:
new_list

0    1.0
1    1.5
2    2.0
3    2.5
4    3.0
5    3.5
dtype: float64

**EXERCISE 5 - Dictionary-to-Dataframe Conversion
Given a dictionary, convert it into corresponding dataframe and display it**

In [14]:
dict1={'name': ['Vinay', 'Kushal', 'Aman'],
       'age' : [22, 25, 24],
       'occ' : ['engineer', 'doctor', 'accountant']}

In [15]:
d=pd.DataFrame(dict1)

In [16]:
d

     name  age         occ
0   Vinay   22    engineer
1  Kushal   25      doctor
2    Aman   24  accountant

**EXERCISE 6 - 2D List-to-Dataframe Conversion
Given a 2D List, convert it into corresponding dataframe and display it**

In [17]:
list=[[2, 'Vishal', 22],
      [1, 'Kushal', 25],
      [1, 'Aman', 24]]

In [18]:
e=pd.DataFrame(list,columns=['id','name','age'])

In [19]:
e

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

**EXERCISE 7 - Reading CSV to Dataframe
Given a CSV file, read it into a dataframe and display it**

In [21]:
e

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

In [25]:
e.to_csv('test.csv')

In [30]:
dataframe=pd.read_csv('test.csv')

In [28]:
dataframe

   Unnamed: 0  id    name  age
0           0   2  Vishal   22
1           1   1  Kushal   25
2           2   1    Aman   24

**EXERCISE 8 - Setting Custom Index in Dataframe
Given a dataframe, change the index of a dataframe from the default indexes to a particular column**

In [31]:
e

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

In [32]:
new_df=e.set_index('id')

In [33]:
new_df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

**EXERCISE 9 - Sorting a Dataframe by Index
Given a dataframe (say, with custom indexing), sort it by it's index**

In [38]:
new_df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

In [39]:
new_df.sort_index()

      name  age
id
1   Kushal   25
1     Aman   24
2   Vishal   22

**EXERCISE 10 - Sorting a Dataframe by Multiple Columns
Given a dataframe, sort it by multiple columns**

In [40]:
new_df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

In [41]:
new_df.sort_values(by=['id','name'])

      name  age
id
1     Aman   24
1   Kushal   25
2   Vishal   22

**EXERCISE 11 - DataFrame with Custom Index to DataFrame with Dataframe with default indexes
Given a dataframe with custom indexing, convert and it to default indexing and display it**

In [42]:
new_df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

In [43]:
new_df.reset_index()

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

**EXERCISE 12 - Indexing and Selecting Columns in a DataFrame
Given a dataframe, select a particular column and display it**

In [46]:
new_df['name']

id
2    Vishal
1    Kushal
1      Aman
Name: name, dtype: object

**EXERCISE 13 - Indexing and Selecting Rows in a DataFrame
Given a dataframe, select first 2 rows and output them**

In [47]:
new_df.iloc[[0,1],:]

      name  age
id
2   Vishal   22
1   Kushal   25

**EXERCISE 14 - Conditional Selection of Rows in a DataFrame
Given a dataframe, select rows based on a condition**

In [48]:
new_df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

In [50]:
new_df.loc[new_df.age<25]

      name  age
id
2   Vishal   22
1     Aman   24

**EXERCISE 15 - Applying Aggregate Functions
Given is a dataframe showing name, occupation, salary of people. Find the average salary per occupation**

In [52]:
new_df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

In [57]:
new_df.groupby('name')['age'].mean()

name
Aman      24.0
Kushal    25.0
Vishal    22.0
Name: age, dtype: float64

**EXERCISE 16 - Filling NaN Values in a DataFrame
Given a dataframe with NaN Values, fill the NaN values with 0**

In [58]:
new_df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

In [60]:
new_df.fillna(100) #fillna fills the Nan filed with given value i.e 100)

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

**EXERCISE 17 - Getting the Non-Null Count and Data Type for Every Column
Given a dataframe, output the non-null count and data-type for every column**

In [61]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 2 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

**EXERCISE 18 - Getting the Statistical Summary of all the Numerical Features of a DataFrame
Given a dataframe, generate the statistical summary of all the numerical features present in it**

In [62]:
new_df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

In [65]:
new_df.describe()

             age
count   3.000000
mean   23.666667
std     1.527525
min    22.000000
25%    23.000000
50%    24.000000
75%    24.500000
max    25.000000